app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "published_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "test"], ["body", nil], ["created_at", "2024-10-28 20:49:46.721613"], ["updated_at", "2024-10-28 20:49:46.721613"], ["published_at", nil]]
---
  def create
    @post = Post.new(post_params)
    if @post.save

UPDATE "posts" SET "updated_at" = ?, "published_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2024-10-26 21:03:56.574637"], ["published_at", "2029-10-13 12:13:00"], ["id", 1]]
---
  def update
    if @post.update(post_params)