app/controllers/topics_controller.rb

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("Topic", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["Topic", "Daily entries"], ["created_at", "2025-01-27 14:06:44.000863"], ["updated_at", "2025-01-27 14:06:44.000863"]]